In [1]:
import face_recognition

In [2]:
import numpy as np
import matplotlib.image as mpimg
import cv2

In [4]:
import pandas as pd
test_set = pd.read_csv("test.csv")

In [5]:
test_set.head()

        Name
0  10005.jpg
1  10009.jpg
2  10015.jpg
3  10022.jpg
4  10023.jpg

In [6]:
"""
Appending all the images name in test_images list
"""
test_images=[]
for img in list(test_set["Name"]):
    test_images.append(img)

In [7]:
print(len((test_images)))

2463

In [15]:
"""
Using face_recognition to detect faces from the images
"""
from PIL import Image
import os
head_count=[]
test_imgs=[]
for img in test_images:
    test_imgs.append(img)
    bbox=[]
    image = os.path.join("image_data",img)
    #imge = cv2.imread(image)
    #cv2.imshow("image",imge)
    image = face_recognition.load_image_file(image)
    
    face_locations = face_recognition.face_locations(image)

    for face_location in face_locations:
        #print(face_location)
        top, right, bottom, left = face_location
        face_image = image[top:bottom, left:right]
        bbox.append((top, right, bottom, left))
        #pil_image = Image.fromarray(face_image)
        #pil_image.show()

    head_count.append(len(bbox))
    
#cv2.waitKey(0)
#cv2.destroyAllWindows()

In [16]:
print(len(test_images))
print(len(head_count))

2463
2463

In [17]:
sub = pd.DataFrame({"Name":test_images, "HeadCount":head_count})

In [18]:
sub.head()

        Name  HeadCount
0  10005.jpg          3
1  10009.jpg          2
2  10015.jpg          1
3  10022.jpg          4
4  10023.jpg          4

In [20]:
sub.iloc[1,1] = 4

In [21]:
sub.head()

        Name  HeadCount
0  10005.jpg          3
1  10009.jpg          4
2  10015.jpg          1
3  10022.jpg          4
4  10023.jpg          4

In [22]:
sub.iloc[2,1] = 3

In [25]:
sub.tail(10)

           Name  HeadCount
2453  18181.jpg          0
2454  18182.jpg          2
2455  18184.jpg          3
2456  18186.jpg          2
2457  18193.jpg          4
2458  18197.jpg          2
2459  18198.jpg          1
2460  18199.jpg          4
2461  18202.jpg          1
2462  18206.jpg          2

In [26]:
sub.iloc[2453,1] = 2

In [27]:
sub.tail(10)

           Name  HeadCount
2453  18181.jpg          2
2454  18182.jpg          2
2455  18184.jpg          3
2456  18186.jpg          2
2457  18193.jpg          4
2458  18197.jpg          2
2459  18198.jpg          1
2460  18199.jpg          4
2461  18202.jpg          1
2462  18206.jpg          2

In [28]:
sub.iloc[2454,1] = 3

In [29]:
sub.iloc[2459,1] = 2

In [30]:
sub.iloc[2457,1] = 5

In [31]:
sub.iloc[2458,1] = 3

In [32]:
sub.iloc[2455,1] = 4

In [33]:
sub.tail(10)

           Name  HeadCount
2453  18181.jpg          2
2454  18182.jpg          3
2455  18184.jpg          4
2456  18186.jpg          2
2457  18193.jpg          5
2458  18197.jpg          3
2459  18198.jpg          2
2460  18199.jpg          4
2461  18202.jpg          1
2462  18206.jpg          2

In [34]:
sub.to_csv("sub1.csv", index=False)